app/Controllers/AdminController/Dashboard.php

    public function message_list()

    {

        $msgModel = new MessagesModel();

        $message = $msgModel->findAll();
---
SELECT *
FROM `messages`