app/Controllers/AdminController/GalleriesController.php

    public function delete($id)
    {
        $session = session();
        $servModel = new GalleriesModel();

        // Fetch the service record
        $service = $servModel->where('id', $id)->first();

        if (!$service) {
            $session->setFlashdata('invalid_creds', [
                'errors' => ['Service not found'],
                'type' => 'danger'
            ]);
            return redirect()->back();
        }

        // Delete image file if it exists
        if (!empty($service['gal_image'])) {
            $imagePath = 'uploads/gallery_image/' . $service['gal_image'];
            if (file_exists($imagePath)) {
                unlink($imagePath);
            }
        }

        // Delete the record from database
        $servModel->delete($id);
---
SELECT *
FROM `galleries`
WHERE `id` = '1'
 LIMIT 1
DELETE FROM `galleries`
WHERE `id` IN ('1')