app/Controllers/AdminController/ServicesController.php

    public function index()
    {
        $servicesModel = new ServicesModel();
        $servicesDetails = $servicesModel->findAll();
---
SELECT *
FROM `services`

    public function edit($id)
    {
        helper('form');

        $session = session();
        $servModel = new ServicesModel();

        if ($this->request->getMethod() === 'GET') {
            $servD = $servModel->select()->where('id', $id)->first();
            return view('admin/services/edit', ['serviceDetails' => $servD]);
        } else {
            $image = \Config\Services::image();
            $serviceDetails = $servModel->where('id', $id)->first(); // Get old data
---
SELECT *
FROM `services`
WHERE `id` = '2'
 LIMIT 1

    public function delete($id)
    {
        $session = session();
        $servModel = new ServicesModel();

        // Fetch the service record
        $service = $servModel->where('id', $id)->first();

        if (!$service) {
            $session->setFlashdata('invalid_creds', [
                'errors' => ['Service not found'],
                'type' => 'danger'
            ]);
            return redirect()->back();
        }

        // Delete image file if it exists
        if (!empty($service['service_image'])) {
            $imagePath = 'uploads/service_image/' . $service['service_image'];
            if (file_exists($imagePath)) {
                unlink($imagePath);
            }
        }

        // Delete the record from database
        $servModel->delete($id);
---
SELECT *
FROM `services`
WHERE `id` = '1'
 LIMIT 1
DELETE FROM `services`
WHERE `id` IN ('1')