app/Controllers/BaseController.php

SELECT `id`, `title`
FROM `services`
 LIMIT 5
---
    public function __construct()
    {
        $serviceModel = new ServicesModel();
        $this->data['service_menu_data'] = $serviceModel->select('id, title')->findAll(5);