app/Controllers/Home.php

    public function single_services($id)
    {
        $serviceModel = new ServicesModel();
        $serviceD = $serviceModel->where('id', $id)->first();
        // $this->data['serviceD'] = $serviceD;


        // echo '<pre>';
        // print_r($serviceD);
        // exit;



        $allS = $serviceModel->select('id, title')->findAll();
---
SELECT *
FROM `services`
WHERE `id` = '2'
 LIMIT 1
SELECT `id`, `title`
FROM `services`