app/Models/UserModel.php

    public function checkLoginData($email, $pass)
    {
        $result =  $this->select('user_id,user_email,user_type,user_name')->where(['user_email' => $email, 'user_password' => $pass, 'is_deleted' => '0'])->first();
---
SELECT `user_id`, `user_email`, `user_type`, `user_name`
FROM `users`
WHERE `user_email` = 'a@mail.com'
AND `user_password` = '202cb962ac59075b964b07152d234b70'
AND `is_deleted` = '0'
 LIMIT 1